{
    "principles": [
        {
            "id": "WCAG2:perceivable",
            "num": "1",
            "handle": "Perceivable",
            "text": "Information and user interface components must be presentable to users in ways they can perceive.",
            "guidelines": [
                {
                    "id": "WCAG2:text-equiv",
                    "num": "1.1",
                    "handle": "Text Alternatives",
                    "text": "Provide text alternatives for any non-text content so that it can be changed into other forms people need, such as large print, braille, speech, symbols or simpler language.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:text-equiv-all",
                            "num": "1.1.1",
                            "handle": "Non-text Content",
                            "text": "All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for the situations listed below.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Controls, Input",
                                            "text": "If non-text content is a control or accepts user input, then it has a name that describes its purpose. (Refer to Guideline 4.1 for additional requirements for controls and content that accepts user input.)"
                                        },
                                        {
                                            "handle": "Time-Based Media",
                                            "text": "If non-text content is time-based media, then text alternatives at least provide descriptive identification of the non-text content. (Refer to Guideline 1.2 for additional requirements for media.)"
                                        },
                                        {
                                            "handle": "Test",
                                            "text": "If non-text content is a test or exercise that would be invalid if presented in text, then text alternatives at least provide descriptive identification of the non-text content."
                                        },
                                        {
                                            "handle": "Sensory",
                                            "text": "If non-text content is primarily intended to create a specific sensory experience, then text alternatives at least provide descriptive identification of the non-text content."
                                        },
                                        {
                                            "handle": "CAPTCHA",
                                            "text": "If the purpose of non-text content is to confirm that content is being accessed by a person rather than a computer, then text alternatives that identify and describe the purpose of the non-text content are provided, and alternative forms of CAPTCHA using output modes for different types of sensory perception are provided to accommodate different disabilities."
                                        },
                                        {
                                            "handle": "Decoration, Formatting, Invisible",
                                            "text": "If non-text content is pure decoration, is used only for visual formatting, or is not presented to users, then it is implemented in a way that it can be ignored by assistive technology."
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "WCAG2:media-equiv",
                    "num": "1.2",
                    "handle": "Time-based Media",
                    "text": "Provide alternatives for time-based media.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:media-equiv-av-only-alt",
                            "num": "1.2.1",
                            "handle": "Audio-only and Video-only (Prerecorded)",
                            "text": "For prerecorded audio-only and prerecorded video-only media, the following are true, except when the audio or video is a media alternative for text and is clearly labeled as such:",
                            "level": "A",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Prerecorded Audio-only",
                                            "text": "An alternative for time-based media is provided that presents equivalent information for prerecorded audio-only content."
                                        },
                                        {
                                            "handle": "Prerecorded Video-only",
                                            "text": "Either an alternative for time-based media or an audio track is provided that presents equivalent information for prerecorded video-only content."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:media-equiv-captions",
                            "num": "1.2.2",
                            "handle": "Captions (Prerecorded)",
                            "text": "Captions are provided for all prerecorded audio content in synchronized media, except when the media is a media alternative for text and is clearly labeled as such.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:media-equiv-audio-desc",
                            "num": "1.2.3",
                            "handle": "Audio Description or Media Alternative (Prerecorded)",
                            "text": "An alternative for time-based media or audio description of the prerecorded video content is provided for synchronized media, except when the media is a media alternative for text and is clearly labeled as such.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:media-equiv-real-time-captions",
                            "num": "1.2.4",
                            "handle": "Captions (Live)",
                            "text": "Captions are provided for all live audio content in synchronized media.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:media-equiv-audio-desc-only",
                            "num": "1.2.5",
                            "handle": "Audio Description (Prerecorded)",
                            "text": "Audio description is provided for all prerecorded video content in synchronized media.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:media-equiv-sign",
                            "num": "1.2.6",
                            "handle": "Sign Language (Prerecorded)",
                            "text": "Sign language interpretation is provided for all prerecorded audio content in synchronized media.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:media-equiv-extended-ad",
                            "num": "1.2.7",
                            "handle": "Extended Audio Description (Prerecorded)",
                            "text": "Where pauses in foreground audio are insufficient to allow audio descriptions to convey the sense of the video, extended audio description is provided for all prerecorded video content in synchronized media.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:media-equiv-text-doc",
                            "num": "1.2.8",
                            "handle": "Media Alternative (Prerecorded)",
                            "text": "An alternative for time-based media is provided for all prerecorded synchronized media and for all prerecorded video-only media.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:media-equiv-live-audio-only",
                            "num": "1.2.9",
                            "handle": "Audio-only (Live)",
                            "text": "An alternative for time-based media that presents equivalent information for live audio-only content is provided.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:content-structure-separation",
                    "num": "1.3",
                    "handle": "Adaptable",
                    "text": "Create content that can be presented in different ways (for example simpler layout) without losing information or structure.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:content-structure-separation-programmatic",
                            "num": "1.3.1",
                            "handle": "Info and Relationships",
                            "text": "Information, structure, and relationships conveyed through presentation can be programmatically determined or are available in text.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:content-structure-separation-sequence",
                            "num": "1.3.2",
                            "handle": "Meaningful Sequence",
                            "text": "When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:content-structure-separation-understanding",
                            "num": "1.3.3",
                            "handle": "Sensory Characteristics",
                            "text": "Instructions provided for understanding and operating content do not rely solely on sensory characteristics of components such as shape, size, visual location, orientation, or sound.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "For requirements related to color, refer to Guideline 1.4."
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "WCAG2:visual-audio-contrast",
                    "num": "1.4",
                    "handle": "Distinguishable",
                    "text": "Make it easier for users to see and hear content including separating foreground from background.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:visual-audio-contrast-without-color",
                            "num": "1.4.1",
                            "handle": "Use of Color",
                            "text": "Color is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "This success criterion addresses color perception specifically. Other forms of perception are covered in Guideline 1.3 including programmatic access to color and other visual presentation coding."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-dis-audio",
                            "num": "1.4.2",
                            "handle": "Audio Control",
                            "text": "If any audio on a Web page plays automatically for more than 3 seconds, either a mechanism is available to pause or stop the audio, or a mechanism is available to control audio volume independently from the overall system volume level.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "Since any content that does not meet this success criterion can interfere with a user's ability to use the whole page, all content on the Web page (whether or not it is used to meet other success criteria) must meet this success criterion. See Conformance Requirement 5: Non-Interference."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-contrast",
                            "num": "1.4.3",
                            "handle": "Contrast (Minimum)",
                            "text": "The visual presentation of text and images of text has a contrast ratio of at least 4.5:1, except for the following:",
                            "level": "AA",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Large Text",
                                            "text": "Large-scale text and images of large-scale text have a contrast ratio of at least 3:1;"
                                        },
                                        {
                                            "handle": "Incidental",
                                            "text": "Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant other visual content, have no contrast requirement."
                                        },
                                        {
                                            "handle": "Logotypes",
                                            "text": "Text that is part of a logo or brand name has no minimum contrast requirement."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-scale",
                            "num": "1.4.4",
                            "handle": "Resize text",
                            "text": "Except for captions and images of text, text can be resized without assistive technology up to 200 percent without loss of content or functionality.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-text-presentation",
                            "num": "1.4.5",
                            "handle": "Images of Text",
                            "text": "If the technologies being used can achieve the visual presentation, text is used to convey information rather than images of text except for the following:",
                            "level": "AA",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Customizable",
                                            "text": "The image of text can be visually customized to the user's requirements;"
                                        },
                                        {
                                            "handle": "Essential",
                                            "text": "A particular presentation of text is essential to the information being conveyed."
                                        }
                                    ]
                                },
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "Logotypes (text that is part of a logo or brand name) are considered essential."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast7",
                            "num": "1.4.6",
                            "handle": "Contrast (Enhanced)",
                            "text": "The visual presentation of text and images of text has a contrast ratio of at least 7:1, except for the following:",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Large Text",
                                            "text": "Large-scale text and images of large-scale text have a contrast ratio of at least 4.5:1;"
                                        },
                                        {
                                            "handle": "Incidental",
                                            "text": "Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant other visual content, have no contrast requirement."
                                        },
                                        {
                                            "handle": "Logotypes",
                                            "text": "Text that is part of a logo or brand name has no minimum contrast requirement."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-noaudio",
                            "num": "1.4.7",
                            "handle": "Low or No Background Audio",
                            "text": "For prerecorded audio-only content that (1) contains primarily speech in the foreground, (2) is not an audio CAPTCHA or audio logo, and (3) is not vocalization intended to be primarily musical expression such as singing or rapping, at least one of the following is true:",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "No Background",
                                            "text": "The audio does not contain background sounds."
                                        },
                                        {
                                            "handle": "Turn Off",
                                            "text": "The background sounds can be turned off."
                                        },
                                        {
                                            "handle": "20 dB",
                                            "text": "The background sounds are at least 20 decibels lower than the foreground speech content, with the exception of occasional sounds that last for only one or two seconds.Note: Per the definition of \"decibel,\" background sound that meets this requirement will be approximately four times quieter than the foreground speech content."
                                        }
                                    ]
                                },
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "Per the definition of \"decibel,\" background sound that meets this requirement will be approximately four times quieter than the foreground speech content."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-visual-presentation",
                            "num": "1.4.8",
                            "handle": "Visual Presentation",
                            "text": "For the visual presentation of blocks of text, a mechanism is available to achieve the following:",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "olist",
                                    "items": [
                                        {
                                            "handle": "",
                                            "text": "Foreground and background colors can be selected by the user."
                                        },
                                        {
                                            "handle": "",
                                            "text": "Width is no more than 80 characters or glyphs (40 if CJK)."
                                        },
                                        {
                                            "handle": "",
                                            "text": "Text is not justified (aligned to both the left and the right margins)."
                                        },
                                        {
                                            "handle": "",
                                            "text": "Line spacing (leading) is at least space-and-a-half within paragraphs, and paragraph spacing is at least 1.5 times larger than the line spacing."
                                        },
                                        {
                                            "handle": "",
                                            "text": "Text can be resized without assistive technology up to 200 percent in a way that does not require the user to scroll horizontally to read a line of text on a full-screen window."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-text-images",
                            "num": "1.4.9",
                            "handle": "Images of Text (No Exception)",
                            "text": "Images of text are only used for pure decoration or where a particular presentation of text is essential to the information being conveyed.",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "Logotypes (text that is part of a logo or brand name) are considered essential."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "WCAG2:operable",
            "num": "2",
            "handle": "Operable",
            "text": "User interface components and navigation must be operable.",
            "guidelines": [
                {
                    "id": "WCAG2:keyboard-operation",
                    "num": "2.1",
                    "handle": "Keyboard Accessible",
                    "text": "Make all functionality available from a keyboard.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:keyboard-operation-keyboard-operable",
                            "num": "2.1.1",
                            "handle": "Keyboard",
                            "text": "All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes, except where the underlying function requires input that depends on the path of the user's movement and not just the endpoints.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note 1",
                                    "text": "This exception relates to the underlying function, not the input technique. For example, if using handwriting to enter text, the input technique (handwriting) requires path-dependent input but the underlying function (text input) does not."
                                },
                                {
                                    "type": "note",
                                    "handle": "Note 2",
                                    "text": "This does not forbid and should not discourage providing mouse input or other input methods in addition to keyboard operation."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:keyboard-operation-trapping",
                            "num": "2.1.2",
                            "handle": "No Keyboard Trap",
                            "text": "If keyboard focus can be moved to a component of the page using a keyboard interface, then focus can be moved away from that component using only a keyboard interface, and, if it requires more than unmodified arrow or tab keys or other standard exit methods, the user is advised of the method for moving focus away.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "Since any content that does not meet this success criterion can interfere with a user's ability to use the whole page, all content on the Web page (whether it is used to meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:keyboard-operation-all-funcs",
                            "num": "2.1.3",
                            "handle": "Keyboard (No Exception)",
                            "text": "All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:time-limits",
                    "num": "2.2",
                    "handle": "Enough Time",
                    "text": "Provide users enough time to read and use content.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:time-limits-required-behaviors",
                            "num": "2.2.1",
                            "handle": "Timing Adjustable",
                            "text": "For each time limit that is set by the content, at least one of the following is true:",
                            "level": "A",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Turn off",
                                            "text": "The user is allowed to turn off the time limit before encountering it; or"
                                        },
                                        {
                                            "handle": "Adjust",
                                            "text": "The user is allowed to adjust the time limit before encountering it over a wide range that is at least ten times the length of the default setting; or"
                                        },
                                        {
                                            "handle": "Extend",
                                            "text": "The user is warned before time expires and given at least 20 seconds to extend the time limit with a simple action (for example, \"press the space bar\"), and the user is allowed to extend the time limit at least ten times; or"
                                        },
                                        {
                                            "handle": "Real-time Exception",
                                            "text": "The time limit is a required part of a real-time event (for example, an auction), and no alternative to the time limit is possible; or"
                                        },
                                        {
                                            "handle": "Essential Exception",
                                            "text": "The time limit is essential and extending it would invalidate the activity; or"
                                        },
                                        {
                                            "handle": "20 Hour Exception",
                                            "text": "The time limit is longer than 20 hours."
                                        }
                                    ]
                                },
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "This success criterion helps ensure that users can complete tasks without unexpected changes in content or context that are a result of a time limit. This success criterion should be considered in conjunction with Success Criterion 3.2.1, which puts limits on changes of content or context as a result of user action."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:time-limits-pause",
                            "num": "2.2.2",
                            "handle": "Pause, Stop, Hide",
                            "text": "For moving, blinking, scrolling, or auto-updating information, all of the following are true:",
                            "level": "A",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Moving, blinking, scrolling",
                                            "text": "For any moving, blinking or scrolling information that (1) starts automatically, (2) lasts more than five seconds, and (3) is presented in parallel with other content, there is a mechanism for the user to pause, stop, or hide it unless the movement, blinking, or scrolling is part of an activity where it is essential; and"
                                        },
                                        {
                                            "handle": "Auto-updating",
                                            "text": "For any auto-updating information that (1) starts automatically and (2) is presented in parallel with other content, there is a mechanism for the user to pause, stop, or hide it or to control the frequency of the update unless the auto-updating is part of an activity where it is essential."
                                        }
                                    ]
                                },
                                {
                                    "type": "note",
                                    "handle": "Note 1",
                                    "text": "For requirements related to flickering or flashing content, refer to Guideline 2.3."
                                },
                                {
                                    "type": "note",
                                    "handle": "Note 2",
                                    "text": "Since any content that does not meet this success criterion can interfere with a user's ability to use the whole page, all content on the Web page (whether it is used to meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference."
                                },
                                {
                                    "type": "note",
                                    "handle": "Note 3",
                                    "text": "Content that is updated periodically by software or that is streamed to the user agent is not required to preserve or present information that is generated or received between the initiation of the pause and resuming presentation, as this may not be technically possible, and in many situations could be misleading to do so."
                                },
                                {
                                    "type": "note",
                                    "handle": "Note 4",
                                    "text": "An animation that occurs as part of a preload phase or similar situation can be considered essential if interaction cannot occur during that phase for all users and if not indicating progress could confuse users or cause them to think that content was frozen or broken."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:time-limits-no-exceptions",
                            "num": "2.2.3",
                            "handle": "No Timing",
                            "text": "Timing is not an essential part of the event or activity presented by the content, except for non-interactive synchronized media and real-time events.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:time-limits-postponed",
                            "num": "2.2.4",
                            "handle": "Interruptions",
                            "text": "Interruptions can be postponed or suppressed by the user, except interruptions involving an emergency.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:time-limits-server-timeout",
                            "num": "2.2.5",
                            "handle": "Re-authenticating",
                            "text": "When an authenticated session expires, the user can continue the activity without loss of data after re-authenticating.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:seizure",
                    "num": "2.3",
                    "handle": "Seizures",
                    "text": "Do not design content in a way that is known to cause seizures.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:seizure-does-not-violate",
                            "num": "2.3.1",
                            "handle": "Three Flashes or Below Threshold",
                            "text": "Web pages do not contain anything that flashes more than three times in any one second period, or the flash is below the general flash and red flash thresholds.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "Since any content that does not meet this success criterion can interfere with a user's ability to use the whole page, all content on the Web page (whether it is used to meet other success criteria or not) must meet this success criterion. See Conformance Requirement 5: Non-Interference."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:seizure-three-times",
                            "num": "2.3.2",
                            "handle": "Three Flashes",
                            "text": "Web pages do not contain anything that flashes more than three times in any one second period.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:navigation-mechanisms",
                    "num": "2.4",
                    "handle": "Navigable",
                    "text": "Provide ways to help users navigate, find content, and determine where they are.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:navigation-mechanisms-skip",
                            "num": "2.4.1",
                            "handle": "Bypass Blocks",
                            "text": "A mechanism is available to bypass blocks of content that are repeated on multiple Web pages.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-title",
                            "num": "2.4.2",
                            "handle": "Page Titled",
                            "text": "Web pages have titles that describe topic or purpose.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-focus-order",
                            "num": "2.4.3",
                            "handle": "Focus Order",
                            "text": "If a Web page can be navigated sequentially and the navigation sequences affect meaning or operation, focusable components receive focus in an order that preserves meaning and operability.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-refs",
                            "num": "2.4.4",
                            "handle": "Link Purpose (In Context)",
                            "text": "The purpose of each link can be determined from the link text alone or from the link text together with its programmatically determined link context, except where the purpose of the link would be ambiguous to users in general.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-mult-loc",
                            "num": "2.4.5",
                            "handle": "Multiple Ways",
                            "text": "More than one way is available to locate a Web page within a set of Web pages except where the Web Page is the result of, or a step in, a process.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-descriptive",
                            "num": "2.4.6",
                            "handle": "Headings and Labels",
                            "text": "Headings and labels describe topic or purpose.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-focus-visible",
                            "num": "2.4.7",
                            "handle": "Focus Visible",
                            "text": "Any keyboard operable user interface has a mode of operation where the keyboard focus indicator is visible.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-location",
                            "num": "2.4.8",
                            "handle": "Location",
                            "text": "Information about the user's location within a set of Web pages is available.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-link",
                            "num": "2.4.9",
                            "handle": "Link Purpose (Link Only)",
                            "text": "A mechanism is available to allow the purpose of each link to be identified from link text alone, except where the purpose of the link would be ambiguous to users in general.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-headings",
                            "num": "2.4.10",
                            "handle": "Section Headings",
                            "text": "Section headings are used to organize the content.",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note 1",
                                    "text": "\"Heading\" is used in its general sense and includes titles and other ways to add a heading to different types of content."
                                },
                                {
                                    "type": "note",
                                    "handle": "Note 2",
                                    "text": "This success criterion covers sections within writing, not user interface components. User Interface components are covered under Success Criterion 4.1.2."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "WCAG2:understandable",
            "num": "3",
            "handle": "Understandable",
            "text": "Information and the operation of user interface must be understandable.",
            "guidelines": [
                {
                    "id": "WCAG2:meaning",
                    "num": "3.1",
                    "handle": "Readable",
                    "text": "Make text content readable and understandable.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:meaning-doc-lang-id",
                            "num": "3.1.1",
                            "handle": "Language of Page",
                            "text": "The default human language of each Web page can be programmatically determined.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:meaning-other-lang-id",
                            "num": "3.1.2",
                            "handle": "Language of Parts",
                            "text": "The human language of each passage or phrase in the content can be programmatically determined except for proper names, technical terms, words of indeterminate language, and words or phrases that have become part of the vernacular of the immediately surrounding text.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:meaning-idioms",
                            "num": "3.1.3",
                            "handle": "Unusual Words",
                            "text": "A mechanism is available for identifying specific definitions of words or phrases used in an unusual or restricted way, including idioms and jargon.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:meaning-located",
                            "num": "3.1.4",
                            "handle": "Abbreviations",
                            "text": "A mechanism for identifying the expanded form or meaning of abbreviations is available.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:meaning-supplements",
                            "num": "3.1.5",
                            "handle": "Reading Level",
                            "text": "When text requires reading ability more advanced than the lower secondary education level after removal of proper names and titles, supplemental content, or a version that does not require reading ability more advanced than the lower secondary education level, is available.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:meaning-pronunciation",
                            "num": "3.1.6",
                            "handle": "Pronunciation",
                            "text": "A mechanism is available for identifying specific pronunciation of words where meaning of the words, in context, is ambiguous without knowing the pronunciation.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:consistent-behavior",
                    "num": "3.2",
                    "handle": "Predictable",
                    "text": "Make Web pages appear and operate in predictable ways.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:consistent-behavior-receive-focus",
                            "num": "3.2.1",
                            "handle": "On Focus",
                            "text": "When any component receives focus, it does not initiate a change of context.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:consistent-behavior-unpredictable-change",
                            "num": "3.2.2",
                            "handle": "On Input",
                            "text": "Changing the setting of any user interface component does not automatically cause a change of context unless the user has been advised of the behavior before using the component.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:consistent-behavior-consistent-locations",
                            "num": "3.2.3",
                            "handle": "Consistent Navigation",
                            "text": "Navigational mechanisms that are repeated on multiple Web pages within a set of Web pages occur in the same relative order each time they are repeated, unless a change is initiated by the user.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:consistent-behavior-consistent-functionality",
                            "num": "3.2.4",
                            "handle": "Consistent Identification",
                            "text": "Components that have the same functionality within a set of Web pages are identified consistently.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:consistent-behavior-no-extreme-changes-context",
                            "num": "3.2.5",
                            "handle": "Change on Request",
                            "text": "Changes of context are initiated only by user request or a mechanism is available to turn off such changes.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:minimize-error",
                    "num": "3.3",
                    "handle": "Input Assistance",
                    "text": "Help users avoid and correct mistakes.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:minimize-error-identified",
                            "num": "3.3.1",
                            "handle": "Error Identification",
                            "text": "If an input error is automatically detected, the item that is in error is identified and the error is described to the user in text.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:minimize-error-cues",
                            "num": "3.3.2",
                            "handle": "Labels or Instructions",
                            "text": "Labels or instructions are provided when content requires user input.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:minimize-error-suggestions",
                            "num": "3.3.3",
                            "handle": "Error Suggestion",
                            "text": "If an input error is automatically detected and suggestions for correction are known, then the suggestions are provided to the user, unless it would jeopardize the security or purpose of the content.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:minimize-error-reversible",
                            "num": "3.3.4",
                            "handle": "Error Prevention (Legal, Financial, Data)",
                            "text": "For Web pages that cause legal commitments or financial transactions for the user to occur, that modify or delete user-controllable data in data storage systems, or that submit user test responses, at least one of the following is true:",
                            "level": "AA",
                            "details": [
                                {
                                    "type": "olist",
                                    "items": [
                                        {
                                            "handle": "Reversible",
                                            "text": "Submissions are reversible."
                                        },
                                        {
                                            "handle": "Checked",
                                            "text": "Data entered by the user is checked for input errors and the user is provided an opportunity to correct them."
                                        },
                                        {
                                            "handle": "Confirmed",
                                            "text": "A mechanism is available for reviewing, confirming, and correcting information before finalizing the submission."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:minimize-error-context-help",
                            "num": "3.3.5",
                            "handle": "Help",
                            "text": "Context-sensitive help is available.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:minimize-error-reversible-all",
                            "num": "3.3.6",
                            "handle": "Error Prevention (All)",
                            "text": "For Web pages that require the user to submit information, at least one of the following is true:",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "olist",
                                    "items": [
                                        {
                                            "handle": "Reversible",
                                            "text": "Submissions are reversible."
                                        },
                                        {
                                            "handle": "Checked",
                                            "text": "Data entered by the user is checked for input errors and the user is provided an opportunity to correct them."
                                        },
                                        {
                                            "handle": "Confirmed",
                                            "text": "A mechanism is available for reviewing, confirming, and correcting information before finalizing the submission."
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "WCAG2:robust",
            "num": "4",
            "handle": "Robust",
            "text": "Content must be robust enough that it can be interpreted reliably by a wide variety of user agents, including assistive technologies.",
            "guidelines": [
                {
                    "id": "WCAG2:ensure-compat",
                    "num": "4.1",
                    "handle": "Compatible",
                    "text": "Maximize compatibility with current and future user agents, including assistive technologies.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:ensure-compat-parses",
                            "num": "4.1.1",
                            "handle": "Parsing",
                            "text": "In content implemented using markup languages, elements have complete start and end tags, elements are nested according to their specifications, elements do not contain duplicate attributes, and any IDs are unique, except where the specifications allow these features.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "Start and end tags that are missing a critical character in their formation, such as a closing angle bracket or a mismatched attribute value quotation mark are not complete."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:ensure-compat-rsv",
                            "num": "4.1.2",
                            "handle": "Name, Role, Value",
                            "text": "For all user interface components (including but not limited to: form elements, links and components generated by scripts), the name and role can be programmatically determined; states, properties, and values that can be set by the user can be programmatically set; and notification of changes to these items is available to user agents, including assistive technologies.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Note",
                                    "text": "This success criterion is primarily for Web authors who develop or script their own user interface components. For example, standard HTML controls already meet this success criterion when used according to specification."
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}